<a href="https://colab.research.google.com/github/sagar9926/Python_For_DataScience/blob/master/PythonTraining/Python_Session_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Table of Content:

* Pandas
    + Importing Data
    + Creating Test Object
    + Viewing Data
    + Selection
    + Data Cleaning
    + Filter, Sort & Group by
    + Iteration
    + Join, Merging
    + Statistics
    + Visualization
    + Exporting Data

# Pandas

Pandas is an open source data analysis library for providing easy-to-use data structures and data analysis tools.

__DataFrame__ is a mXn vector where
* m is the number of rows
* n is the number of columns

__Series__ is a mX1 vector. Hence, each column in DataFrame is known as a pandas series.

__NOTE__ 
* df - A pandas DataFrame object
* s - A pandas Series object

## 1. Importing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
!git clone https://github.com/venky14/Machine-Learning-with-Iris-Dataset.git

Cloning into 'Machine-Learning-with-Iris-Dataset'...
remote: Enumerating objects: 43, done.
remote: Counting objects: 100% (17/17), done.
remote: Compressing objects: 100% (17/17), done.
remote: Total 43 (delta 8), reused 0 (delta 0), pack-reused 26
Unpacking objects: 100% (43/43), done.

In [3]:
df = pd.read_csv('/content/Machine-Learning-with-Iris-Dataset/Iris.csv') #read from csv
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
#pd.read_csv('/content/sample.txt',sep = ' ')

Other ways of importing data depending on the file type.

* __pd.read_table(filename)__ - From a delimited text file (like TSV)
* __pd.read_excel(filename)__ - From an Excel file 
* __pd.read_sql(query, connection_object)__ - Reads from a SQL table/database
* __pd.read_json(json_string)__ - Reads from a JSON file and extracts tables to a list of dataframes

## 2. Create Test Objects
* __pd.DataFrame(dict)__ - From a dict, keys for columns names, values for data as lists
* __pd.DataFrame(np.random.rand(20,5))__ - 5 columns and 20 rows of random floats
* __pd.Series(my_list)__ - Creates a series from an iterable my_list

In [ ]:
d = {'Sagar' : [1,2,3,4],"Priya" : [10,20,30,40],"Batul" :[100,200,300,400]}
print(d)
pd.DataFrame(d)

{'Sagar': [1, 2, 3, 4], 'Priya': [10, 20, 30, 40], 'Batul': [100, 200, 300, 400]}

   Sagar  Priya  Batul
0      1     10    100
1      2     20    200
2      3     30    300
3      4     40    400

In [ ]:
df_dict = pd.DataFrame(columns=['City','State'], data = [['Kolkata','West Bengal'], ['Bangalore','Karnataka']])
df_dict

        City        State
0    Kolkata  West Bengal
1  Bangalore    Karnataka

## 3. Viewing Data

* __df.head(n)__ - First n rows of the DataFrame [__replace head with tail__, you know what you will get]
* __df.shape__ - Number of rows and columns 
* __df.info()__ - Index, Datatype and Memory 
* __df.describe()__ - Summary statistics for numerical columns
* __df.apply(pd.Series.value_counts)__ - Unique values and counts for all columns

__s.value_counts(dropna=False)__ - Views unique values and counts

In [ ]:
print("df shape\n")
print(df.shape)
print("\n================")
print("df info\n")
df.info()

df shape

(150, 6)

================
df info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [ ]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

## 4. Selection

* __df[col]__ or __df.col__- Returns column with label col as Series
* __df[[col1, col2]]__ - Returns Columns as a new DataFrame
* __s.iloc[0]__ - Selection by position/Integer-based indexing
* __s.loc[0]__ - Selection by index/label-based indexing
* __df.loc[:, :]__ and __df.iloc[:, :]__ - First argument represents the number of rows and the second for columns

```
# Single selections using iloc and DataFrame
# Rows:
df.iloc[0] # first row of data frame
df.iloc[1] # second row of data frame
df.iloc[-1] # last row of data frame
# Columns:
df.iloc[:,0] # first column of data frame
df.iloc[:,1] # second column of data frame
df.iloc[:,-1] # last column of data frame
```

In [ ]:
# rows 0 to 4; selective columns using iloc
df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [ ]:
df['SepalLengthCm']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: SepalLengthCm, Length: 150, dtype: float64

In [ ]:
df[['Id','SepalLengthCm']]

      Id  SepalLengthCm
0      1            5.1
1      2            4.9
2      3            4.7
3      4            4.6
4      5            5.0
..   ...            ...
145  146            6.7
146  147            6.3
147  148            6.5
148  149            6.2
149  150            5.9

[150 rows x 2 columns]

In [ ]:
df.iloc[:5 ,:2]

   Id  SepalLengthCm
0   1            5.1
1   2            4.9
2   3            4.7
3   4            4.6
4   5            5.0

In [ ]:
df.iloc[:,1] # first column of data frame

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: SepalLengthCm, Length: 150, dtype: float64

In [ ]:
# rows 0 to 4; all columns
df.loc[0:4,:] # : for columns is optional here since we are asking for all columns

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
df.iloc[0:4,:]

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa

In [ ]:
# rows 0 to 4; selective columns
df.loc[0:4,['Id','SepalWidthCm']]

   Id  SepalWidthCm
0   1           3.5
1   2           3.0
2   3           3.2
3   4           3.1
4   5           3.6

In [ ]:
df.iloc[0:4,['Id','SepalWidthCm']]

IndexError: ignored

__NOTE__: 
* In __loc__, we are mentioning the column names for selection, while in __iloc__ we are specifying the column number
* In __loc__, rows are getting printed including the upper bound, while in __iloc__, it is excluding it

Also __NOTE__ the following:
1. For creating a new DataFrame using column names
```
df[[col1, col2]]
```
is same as
```
df.loc[:,[col1, col2]]
```
2. For printing the first 5 rows of the DataFrame
```
df[0:n]
```
is same as
```
df.iloc[0:n, :]
```

## 5. Data Cleaning


* __df.drop([col1, col2, col3], inplace = True, axis=1)__ - Remove set of column(s)
* __df.columns = ['a','b','c']__ - Renames columns
* __df.isnull()__ - Checks for null Values, Returns Boolean DataFrame
* __df.isnull().any()__ - Returns boolean value for each column, gives True if any null value detected corresponding to that column
* __df.dropna()__ - Drops all rows that contain null values
* __df.dropna(axis=1)__ - Drops all columns that contain null values
* __df.fillna(x)__ - Replaces all null values with x
* __s.replace(1,'one')__ - Replaces all values equal to 1 with 'one'
* __s.replace([1,3], ['one','three'])__ - Replaces all 1 with 'one' and 3 with 'three'
* __df.rename(columns = lambda x: x + '_1')__ - Mass renaming of columns
* __df.rename(columns = {'old_name': 'new_name'})__ - Selective renaming
* __df.rename(index = lambda x: x + 1)__ - Mass renaming of index
* __df[new_col] = df.col1 + ', ' + df.col2__ - Add two columns to create a new column in the same DataFrame
* __df.drop_duplicates(keep='last',inplace=True)__ - Remove duplicate rows

In [ ]:
df_copy = df.copy() #call by value

In [ ]:
print(hex(id(df)))
print(hex(id(df_copy)))

In [ ]:
df_copy.drop(['SepalWidthCm'], inplace=True, axis = 1)
df_copy.head()

NameError: ignored

In [ ]:
df.isnull().sum()

In [ ]:
df_any_null = df.isnull().any()
df_any_null

Id               False
SepalLengthCm    False
SepalWidthCm     False
PetalLengthCm    False
PetalWidthCm     False
Species          False
dtype: bool

In [ ]:
#help(df.dropna)

In [ ]:
df.dropna(axis=0, inplace=True)
df_check_null = df.isnull().sum()
print(df.shape)
df_check_null

(150, 6)

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [ ]:
print(df.shape)

(150, 6)

In [ ]:
df_new_cols_name = df.rename(columns = lambda x: (x.lower()))
df_new_cols_name.head()

   id  sepallengthcm  sepalwidthcm  petallengthcm  petalwidthcm      species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
len(df)

150

In [ ]:
len_df_before = len(df_new_cols_name)
print('Before removing duplicates, the length of dataframe: {}'.format(len_df_before))

# keep : {â€˜firstâ€™, â€˜lastâ€™, False}, default â€˜firstâ€™
# *first : Drop duplicates except for the first occurrence.
# *last : Drop duplicates except for the last occurrence.
# *False : Drop all duplicates.
df_new_cols_name.drop_duplicates(keep='last',inplace=True)

display(df_new_cols_name.head(10).style.highlight_null(null_color='blue'))

len_df_after = len(df_new_cols_name)
print('After removing duplicates, the length of dataframe: {}'.format(len_df_after))

Before removing duplicates, the length of dataframe: 150

After removing duplicates, the length of dataframe: 150

## 6. Filter, Sort & Group By
* __df[df[col] > 0.5]__ - Rows where the values in col > 0.5
* __df[(df[col] > 0.5) & (df[col] < 0.7)]__ - Rows where 0.7 > col > 0.5
* __df.sort_values(col1)__ - Sorts values by col1 in ascending order
* __df.sort_values(col2,ascending=False)__ - Sorts values by col2 in descending order
* __df.sort_values([col1,col2],ascending=[True,False])__ - Sorts values by col1 in ascending order then col2 in descending order

* __df.groupby(col)__ - Returns a groupby object for values from one column
* __df.groupby([col1,col2])__ - Returns a groupby object values from multiple columns
* __df.groupby(col1)[col2].mean()__ - (Aggregation) Returns the mean of the values in col2, grouped by the values in col1 
* __df.pivot_table(index=col1,values=[col2,col3],aggfunc=mean)__ - Creates a pivot table that groups by col1 and calculates the mean of col2 and col3
* __df.apply(np.mean)__ - Applies a function across each column
* __df.apply(np.max, axis=1)__ - Applies a function across each row
* __df.applymap(lambda arg(s): expression)__ - Apply the expression on each value of the DataFrame
* __df[col].map(lambda arg(s): expression)__ - Apply the expression on each value of the column col

In [ ]:
df = df_new_cols_name.copy()

In [ ]:
df.head()

   id  sepallengthcm  sepalwidthcm  petallengthcm  petalwidthcm      species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
df_high_rating = df[(df['sepallengthcm'] > 5) & (df['sepalwidthcm'] < 3)]
print(df_high_rating.shape)
df_high_rating.head()

(51, 6)

    id  sepallengthcm  ...  petalwidthcm          species
53  54            5.5  ...           1.3  Iris-versicolor
54  55            6.5  ...           1.5  Iris-versicolor
55  56            5.7  ...           1.3  Iris-versicolor
58  59            6.6  ...           1.3  Iris-versicolor
59  60            5.2  ...           1.4  Iris-versicolor

[5 rows x 6 columns]

In [ ]:
df.groupby(['species']).agg({'sepallengthcm' : 'mean'}).reset_index()

           species  sepallengthcm
0      Iris-setosa          5.006
1  Iris-versicolor          5.936
2   Iris-virginica          6.588

In [ ]:
df.groupby(['species']).agg({'sepallengthcm' : 'mean','petallengthcm' : 'max'}).reset_index()

           species  sepallengthcm  petallengthcm
0      Iris-setosa          5.006            1.9
1  Iris-versicolor          5.936            5.1
2   Iris-virginica          6.588            6.9

In [ ]:
print(df.groupby('species').size())

species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
dtype: int64

In [ ]:
# iterating through groupby

grouped = df.groupby('species')

print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f04a3b77a50>

In [ ]:
for name,group in grouped:
  print(name)
  print("##########################################")
  print(group)

Iris-setosa
##########################################
    id  sepallengthcm  sepalwidthcm  petallengthcm  petalwidthcm      species
0    1            5.1           3.5            1.4           0.2  Iris-setosa
1    2            4.9           3.0            1.4           0.2  Iris-setosa
2    3            4.7           3.2            1.3           0.2  Iris-setosa
3    4            4.6           3.1            1.5           0.2  Iris-setosa
4    5            5.0           3.6            1.4           0.2  Iris-setosa
5    6            5.4           3.9            1.7           0.4  Iris-setosa
6    7            4.6           3.4            1.4           0.3  Iris-setosa
7    8            5.0           3.4            1.5           0.2  Iris-setosa
8    9            4.4           2.9            1.4           0.2  Iris-setosa
9   10            4.9           3.1            1.5           0.1  Iris-setosa
10  11            5.4           3.7            1.5           0.2  Iris-setosa
11  12            4.8           3.4            1.6           0.2  Iris-setosa
12  13            4.8           3.0            1.4           0.1  Iris-setosa
13  14            4.3           3.0            1.1           0.1  Iris-setosa
14  15            5.8           4.0            1.2           0.2  Iris-setosa
15  16            5.7           4.4            1.5           0.4  Iris-setosa
16  17            5.4           3.9            1.3           0.4  Iris-setosa
17  18            5.1           3.5            1.4           0.3  Iris-setosa
18  19            5.7           3.8            1.7           0.3  Iris-setosa
19  20            5.1           3.8            1.5           0.3  Iris-setosa
20  21            5.4           3.4            1.7           0.2  Iris-setosa
21  22            5.1           3.7            1.5           0.4  Iris-setosa
22  23            4.6           3.6            1.0           0.2  Iris-setosa
23  24            5.1           3.3            1.7           0.5  Iris-setosa
24  25            4.8           3.4            1.9           0.2  Iris-setosa
25  26            5.0           3.0            1.6           0.2  Iris-setosa
26  27            5.0           3.4            1.6           0.4  Iris-setosa
27  28            5.2           3.5            1.5           0.2  Iris-setosa
28  29            5.2           3.4            1.4           0.2  Iris-setosa
29  30            4.7           3.2            1.6           0.2  Iris-setosa
30  31            4.8           3.1            1.6           0.2  Iris-setosa
31  32            5.4           3.4            1.5           0.4  Iris-setosa
32  33            5.2           4.1            1.5           0.1  Iris-setosa
33  34            5.5           4.2            1.4           0.2  Iris-setosa
34  35            4.9           3.1            1.5           0.1  Iris-setosa
35  36            5.0           3.2            1.2           0.2  Iris-setosa
36  37            5.5           3.5            1.3           0.2  Iris-setosa
37  38            4.9           3.1            1.5           0.1  Iris-setosa
38  39            4.4           3.0            1.3           0.2  Iris-setosa
39  40            5.1           3.4            1.5           0.2  Iris-setosa
40  41            5.0           3.5            1.3           0.3  Iris-setosa
41  42            4.5           2.3            1.3           0.3  Iris-setosa
42  43            4.4           3.2            1.3           0.2  Iris-setosa
43  44            5.0           3.5            1.6           0.6  Iris-setosa
44  45            5.1           3.8            1.9           0.4  Iris-setosa
45  46            4.8           3.0            1.4           0.3  Iris-setosa
46  47            5.1           3.8            1.6           0.2  Iris-setosa
47  48            4.6           3.2            1.4           0.2  Iris-setosa
48  49            5.3           3.7            1.5           0.2  Iris-setosa
49  50            5.0           3.3            1.4           0.2  Iris-setosa
Iris-versicolor
##########################################
     id  sepallengthcm  ...  petalwidthcm          species
50   51            7.0  ...           1.4  Iris-versicolor
51   52            6.4  ...           1.5  Iris-versicolor
52   53            6.9  ...           1.5  Iris-versicolor
53   54            5.5  ...           1.3  Iris-versicolor
54   55            6.5  ...           1.5  Iris-versicolor
55   56            5.7  ...           1.3  Iris-versicolor
56   57            6.3  ...           1.6  Iris-versicolor
57   58            4.9  ...           1.0  Iris-versicolor
58   59            6.6  ...           1.3  Iris-versicolor
59   60            5.2  ...           1.4  Iris-versicolor
60   61            5.0  ...           1.0  Iris-versicolor
61   62            5.9  ...           1.5  Iris-versicolor
62   63            6.0  ...           1.0  Iris-versicolor
63   64            6.1  ...           1.4  Iris-versicolor
64   65            5.6  ...           1.3  Iris-versicolor
65   66            6.7  ...           1.4  Iris-versicolor
66   67            5.6  ...           1.5  Iris-versicolor
67   68            5.8  ...           1.0  Iris-versicolor
68   69            6.2  ...           1.5  Iris-versicolor
69   70            5.6  ...           1.1  Iris-versicolor
70   71            5.9  ...           1.8  Iris-versicolor
71   72            6.1  ...           1.3  Iris-versicolor
72   73            6.3  ...           1.5  Iris-versicolor
73   74            6.1  ...           1.2  Iris-versicolor
74   75            6.4  ...           1.3  Iris-versicolor
75   76            6.6  ...           1.4  Iris-versicolor
76   77            6.8  ...           1.4  Iris-versicolor
77   78            6.7  ...           1.7  Iris-versicolor
78   79            6.0  ...           1.5  Iris-versicolor
79   80            5.7  ...           1.0  Iris-versicolor
80   81            5.5  ...           1.1  Iris-versicolor
81   82            5.5  ...           1.0  Iris-versicolor
82   83            5.8  ...           1.2  Iris-versicolor
83   84            6.0  ...           1.6  Iris-versicolor
84   85            5.4  ...           1.5  Iris-versicolor
85   86            6.0  ...           1.6  Iris-versicolor
86   87            6.7  ...           1.5  Iris-versicolor
87   88            6.3  ...           1.3  Iris-versicolor
88   89            5.6  ...           1.3  Iris-versicolor
89   90            5.5  ...           1.3  Iris-versicolor
90   91            5.5  ...           1.2  Iris-versicolor
91   92            6.1  ...           1.4  Iris-versicolor
92   93            5.8  ...           1.2  Iris-versicolor
93   94            5.0  ...           1.0  Iris-versicolor
94   95            5.6  ...           1.3  Iris-versicolor
95   96            5.7  ...           1.2  Iris-versicolor
96   97            5.7  ...           1.3  Iris-versicolor
97   98            6.2  ...           1.3  Iris-versicolor
98   99            5.1  ...           1.1  Iris-versicolor
99  100            5.7  ...           1.3  Iris-versicolor

[50 rows x 6 columns]
Iris-virginica
##########################################
      id  sepallengthcm  ...  petalwidthcm         species
100  101            6.3  ...           2.5  Iris-virginica
101  102            5.8  ...           1.9  Iris-virginica
102  103            7.1  ...           2.1  Iris-virginica
103  104            6.3  ...           1.8  Iris-virginica
104  105            6.5  ...           2.2  Iris-virginica
105  106            7.6  ...           2.1  Iris-virginica
106  107            4.9  ...           1.7  Iris-virginica
107  108            7.3  ...           1.8  Iris-virginica
108  109            6.7  ...           1.8  Iris-virginica
109  110            7.2  ...           2.5  Iris-virginica
110  111            6.5  ...           2.0  Iris-virginica
111  112            6.4  ...           1.9  Iris-virginica
112  113            6.8  ...           2.1  Iris-virginica
113  114            5.7  ...           2.0  Iris-virginica
114  115            5.8  ...           2.4  Iris-virginica
115  116            6.4  ...           2.3  Iris-virginica
116  117            6.5  ...           1.8  Iris-virginica
117  118            7.7  ...           2.2  Iris-virginica
118  119            7.7  ...           2.3  Iris-virginica
119  120            6.0  ...           1.5  Iris-virginica
120  121            6.9  ...           2.3  Iris-virginica
121  122            5.6  ...           2.0  Iris-virginica
122  123            7.7  ...           2.0  Iris-virginica
123  124            6.3  ...           1.8  Iris-virginica
124  125            6.7  ...           2.1  Iris-virginica
125  126            7.2  ...           1.8  Iris-virginica
126  127            6.2  ...           1.8  Iris-virginica
127  128            6.1  ...           1.8  Iris-virginica
128  129            6.4  ...           2.1  Iris-virginica
129  130            7.2  ...           1.6  Iris-virginica
130  131            7.4  ...           1.9  Iris-virginica
131  132            7.9  ...           2.0  Iris-virginica
132  133            6.4  ...           2.2  Iris-virginica
133  134            6.3  ...           1.5  Iris-virginica
134  135            6.1  ...           1.4  Iris-virginica
135  136            7.7  ...           2.3  Iris-virginica
136  137            6.3  ...           2.4  Iris-virginica
137  138            6.4  ...           1.8  Iris-virginica
138  139            6.0  ...           1.8  Iris-virginica
139  140            6.9  ...           2.1  Iris-virginica
140  141            6.7  ...           2.4  Iris-virginica
141  142            6.9  ...           2.3  Iris-virginica
142  143            5.8  ...           1.9  Iris-virginica
143  144            6.8  ...           2.3  Iris-virginica
144  145            6.7  ...           2.5  Iris-virginica
145  146            6.7  ...           2.3  Iris-virginica
146  147            6.3  ...           1.9  Iris-virginica
147  148            6.5  ...           2.0  Iris-virginica
148  149            6.2  ...           2.3  Iris-virginica
149  150            5.9  ...           1.8  Iris-virginica

[50 rows x 6 columns]

## 7. Iteration

To iterate over the rows of the DataFrame, we can use the following functions:
* __df.iteritems()__ âˆ’ to iterate over the (key,value) pairs
* __df.iterrows()__ âˆ’ iterate over the rows as (index,series) pairs
* __df.itertuples()__ âˆ’ this method will return an iterator yielding a named tuple for each row in the DataFrame. The __first element__ of the tuple will be the __rowâ€™s corresponding index value__, while the remaining values are the row values.

In [ ]:
np.random.randn(4,3)

array([[ 0.33321485,  0.51578838, -1.71170472],
       [ 0.47667583,  0.71645138, -0.34035641],
       [-0.02338164, -0.67021483,  2.3137528 ],
       [ 0.2449245 ,  0.67458697,  0.91921747]])

In [ ]:
iterated_df = pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])
iterated_df

       col1      col2      col3
0  0.959740 -2.041273 -0.326061
1 -1.285774 -2.054856 -1.231579
2 -0.741568  1.987779 -0.277983
3 -1.427917 -0.671803 -1.005511

In [ ]:
for key,value in iterated_df.iteritems():
    print(key)
    print(value)

col1
0    0.959740
1   -1.285774
2   -0.741568
3   -1.427917
Name: col1, dtype: float64
col2
0   -2.041273
1   -2.054856
2    1.987779
3   -0.671803
Name: col2, dtype: float64
col3
0   -0.326061
1   -1.231579
2   -0.277983
3   -1.005511
Name: col3, dtype: float64

In [ ]:
for row in iterated_df.itertuples():
    print(row)

Pandas(Index=0, col1=0.9597397154485616, col2=-2.041272800768484, col3=-0.32606124708108075)
Pandas(Index=1, col1=-1.28577443913439, col2=-2.0548564712574904, col3=-1.2315789012073888)
Pandas(Index=2, col1=-0.7415683829736369, col2=1.987779240152938, col3=-0.27798254908566916)
Pandas(Index=3, col1=-1.427916555527142, col2=-0.671803042239934, col3=-1.0055107111380621)

## 8. Operations with text data

String operations can be performed on Series in the format __s.str.op__ where __op__ can be:
1.	__swapcase__ - Swaps the case lower/upper.
2.	__lower() / upper()__ - Converts strings in the Series/Index to lower / upper case.
3.	__len()__ - Computes String length.
4.	__strip()__	- Helps strip whitespace(including newline) from each string in the Series/index from both the sides.
5.	__split(' ')__ - Splits each string with the given pattern.
6.	__cat(sep=' ')__ - Concatenates the series/index elements with given separator.
7.	__get_dummies()__ - Returns the DataFrame with One-Hot Encoded values.
8.	__contains(pattern)__ - Returns Boolean True for each element if the substring contains in the element, else False.
9.	__replace(a,b)__ - Replaces the value a with the value b.
10.	__repeat(value)__ - Repeats each element with specified number of times.
11.	__count(pattern)__ - Returns count of appearance of pattern in each element.
12.	__startswith(pattern) / endswith(pattern)__ - Returns true if the element in the Series/Index starts / ends with the pattern.
13.	__find(pattern)__ - Returns the first position of the first occurrence of the pattern. Returns -1 if not found.
14.	__findall(pattern)__ - Returns a list of all occurrence of the pattern.
15.	__islower() / isupper() / isnumeric()__ - Checks whether all characters in each string in the Series/Index in lower / upper case / numeric or not. Returns Boolean.

In [4]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])
s

0             Tom
1     William Rick
2             John
3          Alber@t
dtype: object

In [5]:
print(s.str.contains(' '))

0     True
1     True
2    False
3    False
dtype: bool

## 9. Joining, Merging

* __df1.append(df2)__ OR __pd.concat([df1, df2], axis=0)__ - Adds the rows in df1 to the end of df2 (columns should be identical)
* __pd.concat([df1, df2], axis=1)__ - Adds the columns in df1 to the end of df2 (rows should be identical)
* __pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=True)__ - where
    + left âˆ’ A DataFrame object.
    + right âˆ’ Another DataFrame object.
    + how âˆ’ One of 'left', 'right', 'outer', 'inner'. Defaults to inner. Each method has been described below.
    + on âˆ’ Columns (names) to join on. __Must be found in both__ the left and right DataFrame objects.
    + left_on âˆ’ Columns from the left DataFrame to use as keys.
    + right_on âˆ’ Columns from the right DataFrame to use as keys.
    + left_index âˆ’ If True, use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame.
    + right_index âˆ’ Same usage as left_index for the right DataFrame.
    + sort âˆ’ Sort the result DataFrame by the join keys in _lexicographical order_. Defaults to True, setting to False will improve the performance substantially in many cases.

| Merge Method | SQL Equivalent	| Description |
|:-:|:-:|:-:|
|left	|LEFT OUTER JOIN	|Use keys from left object
|right	|RIGHT OUTER JOIN	|Use keys from right object
|outer	|FULL OUTER JOIN	|Use union of keys
|inner	|INNER JOIN	|Use intersection of keys

In [6]:
import pandas as pd
left = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayan'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})

right = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Brock', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})

display(left)
display(right)

   id   Name subject_id
0   1   Alex       sub1
1   2    Amy       sub2
2   3  Allen       sub4
3   4  Alice       sub6
4   5   Ayan       sub5

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3  Brock       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [8]:
print("MERGE by ROWS"+'\n')
pd.concat([left,right],ignore_index=True)

MERGE by ROWS

   id   Name subject_id
0   1   Alex       sub1
1   2    Amy       sub2
2   3  Allen       sub4
3   4  Alice       sub6
4   5   Ayan       sub5
5   1  Billy       sub2
6   2  Brian       sub4
7   3  Brock       sub3
8   4  Bryce       sub6
9   5  Betty       sub5

In [10]:
left.append(right)

   id   Name subject_id
0   1   Alex       sub1
1   2    Amy       sub2
2   3  Allen       sub4
3   4  Alice       sub6
4   5   Ayan       sub5
0   1  Billy       sub2
1   2  Brian       sub4
2   3  Brock       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [13]:
print('\n'+"MERGE by COLUMNS"+'\n')
pd.concat([left,right],axis=1) # merging by columns

MERGE by COLUMNS

   id   Name subject_id  id   Name subject_id
0   1   Alex       sub1   1  Billy       sub2
1   2    Amy       sub2   2  Brian       sub4
2   3  Allen       sub4   3  Brock       sub3
3   4  Alice       sub6   4  Bryce       sub6
4   5   Ayan       sub5   5  Betty       sub5

In [17]:
# merge two dataframes on a key
pd.merge(left,right,on='id')

   id Name_x subject_id_x Name_y subject_id_y
0   1   Alex         sub1  Billy         sub2
1   2    Amy         sub2  Brian         sub4
2   3  Allen         sub4  Brock         sub3
3   4  Alice         sub6  Bryce         sub6
4   5   Ayan         sub5  Betty         sub5

In [19]:
# merge two dataframes on multiple keys
pd.merge(left,right,on=['id','subject_id'])

   id Name_x subject_id Name_y
0   4  Alice       sub6  Bryce
1   5   Ayan       sub5  Betty

In [20]:
pd.merge(left, right, on='subject_id', how='right')

   id_x Name_x subject_id  id_y Name_y
0   2.0    Amy       sub2     1  Billy
1   3.0  Allen       sub4     2  Brian
2   NaN    NaN       sub3     3  Brock
3   4.0  Alice       sub6     4  Bryce
4   5.0   Ayan       sub5     5  Betty

## 10. Statistics

* __df.mean()__ - Returns the mean of all columns
* __df.corr()__ - Returns the correlation between columns in a DataFrame
* __df.count()__ - Returns the number of non-null values in each DataFrame column
* __df.max()__ - Returns the highest value in each column
* __df.min()__ - Returns the lowest value in each column
* __df.median()__ - Returns the median of each column
* __df.std()__ - Returns the standard deviation of each column

In [24]:
!git clone https://github.com/tirthajyoti/Machine-Learning-with-Python.git

Cloning into 'Machine-Learning-with-Python'...
remote: Enumerating objects: 1830, done.
remote: Counting objects: 100% (181/181), done.
remote: Compressing objects: 100% (175/175), done.
remote: Total 1830 (delta 90), reused 0 (delta 0), pack-reused 1649
Receiving objects: 100% (1830/1830), 98.74 MiB | 27.43 MiB/s, done.
Resolving deltas: 100% (962/962), done.
Checking out files: 100% (179/179), done.

In [25]:
df_wine = pd.read_csv("/content/Machine-Learning-with-Python/Datasets/wine.data.csv")

In [34]:
df_wine.mean()

Class                             1.938202
Alcohol                          13.000618
Malic acid                        2.336348
Ash                               2.366517
Alcalinity of ash                19.494944
Magnesium                        99.741573
Total phenols                     2.295112
Flavanoids                        2.029270
Nonflavanoid phenols              0.361854
Proanthocyanins                   1.590899
Color intensity                   5.058090
Hue                               0.957449
OD280/OD315 of diluted wines      2.611685
Proline                         746.893258
dtype: float64

In [35]:
df_wine.corr()

                                 Class  ...   Proline
Class                         1.000000  ... -0.633717
Alcohol                      -0.328222  ...  0.643720
Malic acid                    0.437776  ... -0.192011
Ash                          -0.049643  ...  0.223626
Alcalinity of ash             0.517859  ... -0.440597
Magnesium                    -0.209179  ...  0.393351
Total phenols                -0.719163  ...  0.498115
Flavanoids                   -0.847498  ...  0.494193
Nonflavanoid phenols          0.489109  ... -0.311385
Proanthocyanins              -0.499130  ...  0.330417
Color intensity               0.265668  ...  0.316100
Hue                          -0.617369  ...  0.236183
OD280/OD315 of diluted wines -0.788230  ...  0.312761
Proline                      -0.633717  ...  1.000000

[14 rows x 14 columns]